app/controllers/materials_controller.rb

SELECT "materials".* FROM "materials"
---
  def index

    p tag_params_for_index.nil?

    puts "Parameters: #{tag_params_for_index}"


    if tag_params_for_index
      material_tag_link_ids = linked_materials_from tag_ids
      p "*****************"
      p material_tag_link_ids

      # mtl_vote_count = vote_count_for material_tag_link_ids

      mtl_tag_hash = tag_for material_tag_link_ids

      materials = get_materials_for mtl_tag_hash

      p

      p mtl_vote_count
      # p material_ids
      shared_material_ids = get_shared material_tag_link_ids
      materials = (get_materials_from shared_material_ids.uniq) #, only: [:id, :name], include: {materials: {only: [:id, :title, :link_url, :description]}}

      p materials
    else
      materials = Material.all

INSERT INTO "materials" ("title", "description", "link_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    tags = params['material']['tags']

    material = Material.new(material_params_for_create)
    # tags.each { |t| material.tags << Tag.create( name: t['name'] ) }
    tags.each { |t| material.tags << Tag.create( name: t ) }