app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    #Tag.find
    render json: Tag.all, only: [:id, :name]